telink-semi/telink_rf4ce_sdk/tl_rf4ce_sdk/platform/tlsr_b92/reg_include/codec_0581_reg.h
#define REG_DMIC_CTRL6_ADDR                 0x0000C045
#define BF_DMIC_HARD_VOL_INFO               0x0000C045, 0x00000100
#define BF_DMIC_VOL_LINK_INFO               0x0000C045, 0x00000101
#define BF_DMIC_VOL_ZC_INFO                 0x0000C045, 0x00000102

#define REG_DMIC_MUTES_ADDR                 0x0000C046
#define BF_DMIC0_MUTE_INFO                  0x0000C046, 0x00000100
#define BF_DMIC1_MUTE_INFO                  0x0000C046, 0x00000101
#define BF_DMIC2_MUTE_INFO                  0x0000C046, 0x00000102
#define BF_DMIC3_MUTE_INFO                  0x0000C046, 0x00000103
#define BF_DMIC4_MUTE_INFO                  0x0000C046, 0x00000104
#define BF_DMIC5_MUTE_INFO                  0x0000C046, 0x00000105
#define BF_DMIC6_MUTE_INFO                  0x0000C046, 0x00000106
#define BF_DMIC7_MUTE_INFO                  0x0000C046, 0x00000107

#define REG_DMIC_VOL0_ADDR                  0x0000C047
#define BF_DMIC0_VOL_INFO                   0x0000C047, 0x00000800

#define REG_DMIC_VOL1_ADDR                  0x0000C048
#define BF_DMIC1_VOL_INFO                   0x0000C048, 0x00000800

#define REG_DMIC_VOL2_ADDR                  0x0000C049
#define BF_DMIC2_VOL_INFO                   0x0000C049, 0x00000800

#define REG_DMIC_VOL3_ADDR                  0x0000C04A
#define BF_DMIC3_VOL_INFO                   0x0000C04A, 0x00000800

#define REG_DMIC_VOL4_ADDR                  0x0000C04B
#define BF_DMIC4_VOL_INFO                   0x0000C04B, 0x00000800

#define REG_DMIC_VOL5_ADDR                  0x0000C04C
#define BF_DMIC5_VOL_INFO                   0x0000C04C, 0x00000800

#define REG_DMIC_VOL6_ADDR                  0x0000C04D
#define BF_DMIC6_VOL_INFO                   0x0000C04D, 0x00000800

#define REG_DMIC_VOL7_ADDR                  0x0000C04E
#define BF_DMIC7_VOL_INFO                   0x0000C04E, 0x00000800

#define REG_EQ_CFG_ADDR                     0x0000C040
#define BF_EQ_RUN_INFO                      0x0000C040, 0x00000100
#define BF_EQ_CLEAR_INFO                    0x0000C040, 0x00000101
#define BF_EQ_BANK_SEL_INFO                 0x0000C040, 0x00000102

#define REG_EQ_ROUTE_ADDR                   0x0000C044
#define BF_EQ_ROUTE_INFO                    0x0000C044, 0x00000700

#define REG_DAC_CTRL1_ADDR                  0x0000C050
#define BF_DAC_FS_INFO                      0x0000C050, 0x00000300
#define BF_DAC_FCOMP_INFO                   0x0000C050, 0x00000103
#define BF_DAC_LPM_INFO                     0x0000C050, 0x00000106
#define BF_DAC_MORE_FILT_INFO               0x0000C050, 0x00000107

#define REG_DAC_CTRL2_ADDR                  0x0000C051
#define BF_DAC_HARD_VOL_INFO                0x0000C051, 0x00000101
#define BF_DAC_VOL_ZC_INFO                  0x0000C051, 0x00000102
#define BF_DAC_LPM_II_INFO                  0x0000C051, 0x00000103
#define BF_DAC0_HPF_EN_INFO                 0x0000C051, 0x00000104
#define BF_DAC0_MUTE_INFO                   0x0000C051, 0x00000106
#define BF_DAC0_FORCE_MUTE_INFO             0x0000C051, 0x00000107

#define REG_DAC_VOL0_ADDR                   0x0000C052
#define BF_DAC0_VOL_INFO                    0x0000C052, 0x00000800

#define REG_DAC_VOL1_ADDR                   0x0000C053

#define REG_DAC_ROUTE0_ADDR                 0x0000C054
#define BF_DAC0_ROUTE_INFO                  0x0000C054, 0x00000700

#define REG_HP_CTRL_ADDR                    0x0000C060
#define BF_HP0_MODE_INFO                    0x0000C060, 0x00000100

#define REG_HP_LVMODE_CTRL1_ADDR            0x0000C061
#define BF_HP_LVMODE_EN_INFO                0x0000C061, 0x00000100
#define BF_HP_LVMODE_CM_EN_INFO             0x0000C061, 0x00000101

#define REG_HP_LVMODE_CTRL2_ADDR            0x0000C062
#define BF_HP_LVMODE_AUTOSW_MODE_INFO       0x0000C062, 0x00000100
#define BF_HP_LVMODE_AUTO_DLY_INFO          0x0000C062, 0x00000301
#define BF_HP_LVMODE_CM_DLY_INFO            0x0000C062, 0x00000204

#define REG_HP_LVMODE_CTRL3_ADDR            0x0000C063
#define BF_HP_LVMODE_SWITCH_INFO            0x0000C063, 0x00000100

#define REG_HPLDO_CTRL_ADDR                 0x0000C066
#define BF_HPLDO_EN_INFO                    0x0000C066, 0x00000100
#define BF_HPLDO_BYPASS_INFO                0x0000C066, 0x00000101
#define BF_HPLDO_VOUT_SET_INFO              0x0000C066, 0x00000202

#define REG_PB_CTRL_ADDR                    0x0000C06F
#define BF_PB_POWER_CTRL_INFO               0x0000C06F, 0x00000200

#define REG_FDEC_CTRL1_ADDR                 0x0000C070
#define BF_FDEC01_IN_FS_INFO                0x0000C070, 0x00000300
#define BF_FDEC01_OUT_FS_INFO               0x0000C070, 0x00000404

#define REG_FDEC_CTRL2_ADDR                 0x0000C071
#define BF_FDEC23_IN_FS_INFO                0x0000C071, 0x00000300
#define BF_FDEC23_OUT_FS_INFO               0x0000C071, 0x00000404

#define REG_FDEC_ROUTE0_ADDR                0x0000C074
#define BF_FDEC0_ROUTE_INFO                 0x0000C074, 0x00000600

#define REG_FDEC_ROUTE1_ADDR                0x0000C075
#define BF_FDEC1_ROUTE_INFO                 0x0000C075, 0x00000600

#define REG_FDEC_ROUTE2_ADDR                0x0000C076
#define BF_FDEC2_ROUTE_INFO                 0x0000C076, 0x00000600

#define REG_FDEC_ROUTE3_ADDR                0x0000C077
#define BF_FDEC3_ROUTE_INFO                 0x0000C077, 0x00000600

#define REG_FINT_CTRL1_ADDR                 0x0000C080
#define BF_FINT01_IN_FS_INFO                0x0000C080, 0x00000400
#define BF_FINT01_OUT_FS_INFO               0x0000C080, 0x00000304

#define REG_FINT_ROUTE0_ADDR                0x0000C084
#define BF_FINT0_ROUTE_INFO                 0x0000C084, 0x00000700

#define REG_FINT_ROUTE1_ADDR                0x0000C085
#define BF_FINT1_ROUTE_INFO                 0x0000C085, 0x00000700

#define REG_ASRCI_CTRL_ADDR                 0x0000C090
#define BF_ASRCI_OUT_FS_INFO                0x0000C090, 0x00000300
#define BF_ASRCI_LPM_II_INFO                0x0000C090, 0x00000103
#define BF_ASRCI_OSCCAL_LOCK_INFO           0x0000C090, 0x00000104
#define BF_ASRCI_LPM_INFO                   0x0000C090, 0x00000105
#define BF_ASRCI_VFILT_INFO                 0x0000C090, 0x00000106
#define BF_ASRCI_MORE_FILT_INFO             0x0000C090, 0x00000107

#define REG_ASRCI_ROUTE01_ADDR              0x0000C091
#define BF_ASRCI0_ROUTE_INFO                0x0000C091, 0x00000400

#define REG_ASRCO_CTRL_ADDR                 0x0000C093
#define BF_ASRCO_IN_FS_INFO                 0x0000C093, 0x00000300
#define BF_ASRCO_LPM_II_INFO                0x0000C093, 0x00000103
#define BF_ASRCO_OSCCAL_LOCK_INFO           0x0000C093, 0x00000104
#define BF_ASRCO_LPM_INFO                   0x0000C093, 0x00000105
#define BF_ASRCO_VFILT_INFO                 0x0000C093, 0x00000106
#define BF_ASRCO_MORE_FILT_INFO             0x0000C093, 0x00000107

#define REG_ASRCO_ROUTE0_ADDR               0x0000C094
#define BF_ASRCO0_ROUTE_INFO                0x0000C094, 0x00000600

