telink-semi/telink_rf4ce_sdk/tl_rf4ce_sdk/platform/tlsr_b92/reg_include/codec_0581_reg.h
#define REG_SW_EN_CTRL_ADDR                 0x0000C0DB
#define BF_SWEN_DRIVE_INFO                  0x0000C0DB, 0x00000200
#define BF_SWEN_PULL_EN_INFO                0x0000C0DB, 0x00000104
#define BF_SWEN_PULL_SEL_INFO               0x0000C0DB, 0x00000105
#define BF_SWEN_SLEW_INFO                   0x0000C0DB, 0x00000106

#define REG_FSYNC0_CTRL_ADDR                0x0000C0E0
#define BF_FSYNC0_DRIVE_INFO                0x0000C0E0, 0x00000200
#define BF_FSYNC0_SLEW_INFO                 0x0000C0E0, 0x00000102
#define BF_FSYNC0_PULL_EN_INFO              0x0000C0E0, 0x00000104
#define BF_FSYNC0_PULL_SEL_INFO             0x0000C0E0, 0x00000105

#define REG_BCLK0_CTRL_ADDR                 0x0000C0E1
#define BF_BCLK0_DRIVE_INFO                 0x0000C0E1, 0x00000200
#define BF_BCLK0_SLEW_INFO                  0x0000C0E1, 0x00000102
#define BF_BCLK0_PULL_EN_INFO               0x0000C0E1, 0x00000104
#define BF_BCLK0_PULL_SEL_INFO              0x0000C0E1, 0x00000105

#define REG_SDATAO0_CTRL_ADDR               0x0000C0E2
#define BF_SDATAO0_DRIVE_INFO               0x0000C0E2, 0x00000200
#define BF_SDATAO0_SLEW_INFO                0x0000C0E2, 0x00000102
#define BF_SDATAO0_PULL_EN_INFO             0x0000C0E2, 0x00000104
#define BF_SDATAO0_PULL_SEL_INFO            0x0000C0E2, 0x00000105

#define REG_SDATAI0_CTRL_ADDR               0x0000C0E3
#define BF_SDATAI0_DRIVE_INFO               0x0000C0E3, 0x00000200
#define BF_SDATAI0_SLEW_INFO                0x0000C0E3, 0x00000102
#define BF_SDATAI0_PULL_EN_INFO             0x0000C0E3, 0x00000104
#define BF_SDATAI0_PULL_SEL_INFO            0x0000C0E3, 0x00000105

#define REG_IRQ_CTRL_ADDR                   0x0000C0E4
#define BF_IRQ_DRIVE_INFO                   0x0000C0E4, 0x00000200
#define BF_IRQ_SLEW_INFO                    0x0000C0E4, 0x00000102
#define BF_IRQ_PULL_EN_INFO                 0x0000C0E4, 0x00000104
#define BF_IRQ_PULL_SEL_INFO                0x0000C0E4, 0x00000105

#define REG_MCLKO_CTRL_ADDR                 0x0000C0E5
#define BF_MCLKO_DRIVE_INFO                 0x0000C0E5, 0x00000200
#define BF_MCLKO_SLEW_INFO                  0x0000C0E5, 0x00000102
#define BF_MCLKO_PULL_EN_INFO               0x0000C0E5, 0x00000104
#define BF_MCLKO_PULL_SEL_INFO              0x0000C0E5, 0x00000105

#define REG_I2C_SPI_CTRL_ADDR               0x0000C0EC
#define BF_SDA_MISO_DRIVE_INFO              0x0000C0EC, 0x00000200
#define BF_SDA_MISO_SLEW_INFO               0x0000C0EC, 0x00000102
#define BF_SCL_SCLK_DRIVE_INFO              0x0000C0EC, 0x00000204
#define BF_SCL_SCLK_SLEW_INFO               0x0000C0EC, 0x00000106

#define REG_IRQ_CTRL1_ADDR                  0x0000C100
#define BF_IRQ1_CLEAR_INFO                  0x0000C100, 0x00000100
#define BF_IRQ2_CLEAR_INFO                  0x0000C100, 0x00000101
#define BF_IRQ1_PINOUT_POL_INFO             0x0000C100, 0x00000104
#define BF_IRQ2_PINOUT_POL_INFO             0x0000C100, 0x00000105

#define REG_IRQ1_MASK1_ADDR                 0x0000C101
#define BF_IRQ1_DAC0_CLIP_MASK_INFO         0x0000C101, 0x00000100
#define BF_IRQ1_ADC0_CLIP_MASK_INFO         0x0000C101, 0x00000104
#define BF_IRQ1_ADC1_CLIP_MASK_INFO         0x0000C101, 0x00000105
#define BF_IRQ1_ADC2_CLIP_MASK_INFO         0x0000C101, 0x00000106

#define REG_IRQ1_MASK2_ADDR                 0x0000C102
#define BF_IRQ1_PLL_LOCKED_MASK_INFO        0x0000C102, 0x00000100
#define BF_IRQ1_PLL_UNLOCKED_MASK_INFO      0x0000C102, 0x00000101
#define BF_IRQ1_AVDD_UVW_MASK_INFO          0x0000C102, 0x00000102
#define BF_IRQ1_PRAMP_MASK_INFO             0x0000C102, 0x00000103
#define BF_IRQ1_ASRCI_LOCKED_MASK_INFO      0x0000C102, 0x00000104
#define BF_IRQ1_ASRCI_UNLOCKED_MASK_INFO    0x0000C102, 0x00000105
#define BF_IRQ1_ASRCO_LOCKED_MASK_INFO      0x0000C102, 0x00000106
#define BF_IRQ1_ASRCO_UNLOCKED_MASK_INFO    0x0000C102, 0x00000107

#define REG_IRQ1_MASK3_ADDR                 0x0000C103
#define BF_IRQ1_SPT0_UNLOCKED_MASK_INFO     0x0000C103, 0x00000100
#define BF_IRQ1_SYNC_LOCKED_MASK_INFO       0x0000C103, 0x00000101
#define BF_IRQ1_SYNC_UNLOCKED_MASK_INFO     0x0000C103, 0x00000102
#define BF_IRQ1_POWER_UP_COMPLETE_MASK_INFO 0x0000C103, 0x00000104
#define BF_IRQ1_EQ_CLEAR_DONE_MASK_INFO     0x0000C103, 0x00000105
#define BF_IRQ1_FDSP_MASK_ONZ_MASK_INFO     0x0000C103, 0x00000106

#define REG_IRQ2_MASK1_ADDR                 0x0000C104
#define BF_IRQ2_DAC0_CLIP_MASK_INFO         0x0000C104, 0x00000100
#define BF_IRQ2_ADC0_CLIP_MASK_INFO         0x0000C104, 0x00000104
#define BF_IRQ2_ADC1_CLIP_MASK_INFO         0x0000C104, 0x00000105
#define BF_IRQ2_ADC2_CLIP_MASK_INFO         0x0000C104, 0x00000106

#define REG_IRQ2_MASK2_ADDR                 0x0000C105
#define BF_IRQ2_PLL_LOCKED_MASK_INFO        0x0000C105, 0x00000100
#define BF_IRQ2_PLL_UNLOCKED_MASK_INFO      0x0000C105, 0x00000101
#define BF_IRQ2_AVDD_UVW_MASK_INFO          0x0000C105, 0x00000102
#define BF_IRQ2_PRAMP_MASK_INFO             0x0000C105, 0x00000103
#define BF_IRQ2_ASRCI_LOCKED_MASK_INFO      0x0000C105, 0x00000104
#define BF_IRQ2_ASRCI_UNLOCKED_MASK_INFO    0x0000C105, 0x00000105
#define BF_IRQ2_ASRCO_LOCKED_MASK_INFO      0x0000C105, 0x00000106
#define BF_IRQ2_ASRCO_UNLOCKED_MASK_INFO    0x0000C105, 0x00000107

#define REG_IRQ2_MASK3_ADDR                 0x0000C106
#define BF_IRQ2_SPT0_UNLOCKED_MASK_INFO     0x0000C106, 0x00000100
#define BF_IRQ2_SYNC_LOCKED_MASK_INFO       0x0000C106, 0x00000101
#define BF_IRQ2_SYNC_UNLOCKED_MASK_INFO     0x0000C106, 0x00000102
#define BF_IRQ2_POWER_UP_COMPLETE_MASK_INFO 0x0000C106, 0x00000104
#define BF_IRQ2_EQ_CLEAR_DONE_MASK_INFO     0x0000C106, 0x00000105
#define BF_IRQ2_FDSP_MASK_ONZ_MASK_INFO     0x0000C106, 0x00000106

#define REG_RESETS_ADDR                     0x0000C120
#define BF_SOFT_FULL_RESET_INFO             0x0000C120, 0x00000100
#define BF_SOFT_RESET_INFO                  0x0000C120, 0x00000104

#define REG_READ_LAMBDA_ADDR                0x0000C130
#define BF_FDSP_CURRENT_LAMBDA_INFO         0x0000C130, 0x00000600

#define REG_STATUS1_ADDR                    0x0000C131
#define BF_DAC0_CLIP_INFO                   0x0000C131, 0x00000100
#define BF_ADC0_CLIP_INFO                   0x0000C131, 0x00000104
#define BF_ADC1_CLIP_INFO                   0x0000C131, 0x00000105
#define BF_ADC2_CLIP_INFO                   0x0000C131, 0x00000106

#define REG_STATUS2_ADDR                    0x0000C132
#define BF_PLL_LOCK_INFO                    0x0000C132, 0x00000100
#define BF_AVDD_UVW_INFO                    0x0000C132, 0x00000101
#define BF_ASRCI_LOCK_INFO                  0x0000C132, 0x00000102
#define BF_ASRCO_LOCK_INFO                  0x0000C132, 0x00000103
#define BF_SPT0_LOCK_INFO                   0x0000C132, 0x00000104
#define BF_SYNC_LOCK_INFO                   0x0000C132, 0x00000106
#define BF_POWER_UP_COMPLETE_INFO           0x0000C132, 0x00000107

#define REG_STATUS3_ADDR                    0x0000C133
#define BF_FDSP_MASK_ONZ_INFO               0x0000C133, 0x00000100
#define BF_FDSP_BANK_COPY_DONE_INFO         0x0000C133, 0x00000104

