telink-semi/telink_rf4ce_sdk/tl_rf4ce_sdk/platform/tlsr_b92/reg_include/codec_0581_reg.h
#define REG_GPI2_ADDR                       0x0000C135

#define REG_EQ_STATUS_ADDR                  0x0000C136
#define BF_EQ_CLEAR_DONE_INFO               0x0000C136, 0x00000100

#define REG_IRQ1_STATUS1_ADDR               0x0000C138
#define BF_IRQ1_DAC0_CLIP_INFO              0x0000C138, 0x00000100
#define BF_IRQ1_ADC0_CLIP_INFO              0x0000C138, 0x00000104
#define BF_IRQ1_ADC1_CLIP_INFO              0x0000C138, 0x00000105
#define BF_IRQ1_ADC2_CLIP_INFO              0x0000C138, 0x00000106

#define REG_IRQ1_STATUS2_ADDR               0x0000C139
#define BF_IRQ1_PLL_LOCKED_INFO             0x0000C139, 0x00000100
#define BF_IRQ1_PLL_UNLOCKED_INFO           0x0000C139, 0x00000101
#define BF_IRQ1_AVDD_UVW_INFO               0x0000C139, 0x00000102
#define BF_IRQ1_PRAMP_INFO                  0x0000C139, 0x00000103
#define BF_IRQ1_ASRCI_LOCKED_INFO           0x0000C139, 0x00000104
#define BF_IRQ1_ASRCI_UNLOCKED_INFO         0x0000C139, 0x00000105
#define BF_IRQ1_ASRCO_LOCKED_INFO           0x0000C139, 0x00000106
#define BF_IRQ1_ASRCO_UNLOCKED_INFO         0x0000C139, 0x00000107

#define REG_IRQ1_STATUS3_ADDR               0x0000C13A
#define BF_IRQ1_SYNC_LOCKED_INFO            0x0000C13A, 0x00000100
#define BF_IRQ1_SYNC_UNLOCKED_INFO          0x0000C13A, 0x00000101
#define BF_IRQ1_SPT0_UNLOCKED_INFO          0x0000C13A, 0x00000102
#define BF_IRQ1_POWER_UP_COMPLETE_INFO      0x0000C13A, 0x00000104
#define BF_IRQ1_EQ_CLEAR_DONE_INFO          0x0000C13A, 0x00000105
#define BF_IRQ1_FDSP_MASK_ONZ_INFO          0x0000C13A, 0x00000106

#define REG_IRQ2_STATUS1_ADDR               0x0000C13B
#define BF_IRQ2_DAC0_CLIP_INFO              0x0000C13B, 0x00000100
#define BF_IRQ2_ADC0_CLIP_INFO              0x0000C13B, 0x00000104
#define BF_IRQ2_ADC1_CLIP_INFO              0x0000C13B, 0x00000105
#define BF_IRQ2_ADC2_CLIP_INFO              0x0000C13B, 0x00000106

#define REG_IRQ2_STATUS2_ADDR               0x0000C13C
#define BF_IRQ2_PLL_LOCKED_INFO             0x0000C13C, 0x00000100
#define BF_IRQ2_PLL_UNLOCKED_INFO           0x0000C13C, 0x00000101
#define BF_IRQ2_AVDD_UVW_INFO               0x0000C13C, 0x00000102
#define BF_IRQ2_PRAMP_INFO                  0x0000C13C, 0x00000103
#define BF_IRQ2_ASRCI_LOCKED_INFO           0x0000C13C, 0x00000104
#define BF_IRQ2_ASRCI_UNLOCKED_INFO         0x0000C13C, 0x00000105
#define BF_IRQ2_ASRCO_LOCKED_INFO           0x0000C13C, 0x00000106
#define BF_IRQ2_ASRCO_UNLOCKED_INFO         0x0000C13C, 0x00000107

#define REG_IRQ2_STATUS3_ADDR               0x0000C13D
#define BF_IRQ2_SYNC_LOCKED_INFO            0x0000C13D, 0x00000100
#define BF_IRQ2_SYNC_UNLOCKED_INFO          0x0000C13D, 0x00000101
#define BF_IRQ2_SPT0_UNLOCKED_INFO          0x0000C13D, 0x00000102
#define BF_IRQ2_POWER_UP_COMPLETE_INFO      0x0000C13D, 0x00000104
#define BF_IRQ2_EQ_CLEAR_DONE_INFO          0x0000C13D, 0x00000105
#define BF_IRQ2_FDSP_MASK_ONZ_INFO          0x0000C13D, 0x00000106

#define REG_SPT0_CTRL1_ADDR                 0x0000C150
#define BF_SPT0_SAI_MODE_INFO               0x0000C150, 0x00000100
#define BF_SPT0_DATA_FORMAT_INFO            0x0000C150, 0x00000301
#define BF_SPT0_SLOT_WIDTH_INFO             0x0000C150, 0x00000204
#define BF_SPT0_TRI_STATE_INFO              0x0000C150, 0x00000106

#define REG_SPT0_CTRL2_ADDR                 0x0000C151
#define BF_SPT0_BCLK_SRC_INFO               0x0000C151, 0x00000300
#define BF_SPT0_BCLK_POL_INFO               0x0000C151, 0x00000103

#define REG_SPT0_CTRL3_ADDR                 0x0000C152
#define BF_SPT0_LRCLK_SRC_INFO              0x0000C152, 0x00000400
#define BF_SPT0_LRCLK_POL_INFO              0x0000C152, 0x00000104

#define REG_SPT0_ROUTE0_ADDR                0x0000C153
#define BF_SPT0_OUT_ROUTE0_INFO             0x0000C153, 0x00000600

#define REG_SPT0_ROUTE1_ADDR                0x0000C154
#define BF_SPT0_OUT_ROUTE1_INFO             0x0000C154, 0x00000600

#define REG_SPT0_ROUTE2_ADDR                0x0000C155
#define BF_SPT0_OUT_ROUTE2_INFO             0x0000C155, 0x00000600

#define REG_SPT0_ROUTE3_ADDR                0x0000C156
#define BF_SPT0_OUT_ROUTE3_INFO             0x0000C156, 0x00000600

#define REG_SPT0_ROUTE4_ADDR                0x0000C157
#define BF_SPT0_OUT_ROUTE4_INFO             0x0000C157, 0x00000600

#define REG_SPT0_ROUTE5_ADDR                0x0000C158
#define BF_SPT0_OUT_ROUTE5_INFO             0x0000C158, 0x00000600

#define REG_SPT0_ROUTE6_ADDR                0x0000C159
#define BF_SPT0_OUT_ROUTE6_INFO             0x0000C159, 0x00000600

#define REG_SPT0_ROUTE7_ADDR                0x0000C15A
#define BF_SPT0_OUT_ROUTE7_INFO             0x0000C15A, 0x00000600

#define REG_SPT0_ROUTE8_ADDR                0x0000C15B
#define BF_SPT0_OUT_ROUTE8_INFO             0x0000C15B, 0x00000600

#define REG_SPT0_ROUTE9_ADDR                0x0000C15C
#define BF_SPT0_OUT_ROUTE9_INFO             0x0000C15C, 0x00000600

#define REG_SPT0_ROUTE10_ADDR               0x0000C15D
#define BF_SPT0_OUT_ROUTE10_INFO            0x0000C15D, 0x00000600

#define REG_SPT0_ROUTE11_ADDR               0x0000C15E
#define BF_SPT0_OUT_ROUTE11_INFO            0x0000C15E, 0x00000600

#define REG_SPT0_ROUTE12_ADDR               0x0000C15F
#define BF_SPT0_OUT_ROUTE12_INFO            0x0000C15F, 0x00000600

#define REG_SPT0_ROUTE13_ADDR               0x0000C160
#define BF_SPT0_OUT_ROUTE13_INFO            0x0000C160, 0x00000600

#define REG_SPT0_ROUTE14_ADDR               0x0000C161
#define BF_SPT0_OUT_ROUTE14_INFO            0x0000C161, 0x00000600

#define REG_SPT0_ROUTE15_ADDR               0x0000C162
#define BF_SPT0_OUT_ROUTE15_INFO            0x0000C162, 0x00000600

#define REG_PDM_CTRL1_ADDR                  0x0000C180
#define BF_PDM_FS_INFO                      0x0000C180, 0x00000300
#define BF_PDM_FCOMP_INFO                   0x0000C180, 0x00000103
#define BF_PDM_RATE_INFO                    0x0000C180, 0x00000104
#define BF_PDM_MORE_FILT_INFO               0x0000C180, 0x00000107

#define REG_PDM_CTRL2_ADDR                  0x0000C181
#define BF_PDM_VOL_LINK_INFO                0x0000C181, 0x00000100
#define BF_PDM_HARD_VOL_INFO                0x0000C181, 0x00000101
#define BF_PDM_VOL_ZC_INFO                  0x0000C181, 0x00000102
#define BF_PDM0_HPF_EN_INFO                 0x0000C181, 0x00000104
#define BF_PDM1_HPF_EN_INFO                 0x0000C181, 0x00000105
#define BF_PDM0_MUTE_INFO                   0x0000C181, 0x00000106
#define BF_PDM1_MUTE_INFO                   0x0000C181, 0x00000107

#define REG_PDM_VOL0_ADDR                   0x0000C182
#define BF_PDM0_VOL_INFO                    0x0000C182, 0x00000800

#define REG_PDM_VOL1_ADDR                   0x0000C183
#define BF_PDM1_VOL_INFO                    0x0000C183, 0x00000800

#define REG_PDM_ROUTE0_ADDR                 0x0000C184
#define BF_PDM0_ROUTE_INFO                  0x0000C184, 0x00000700

#define REG_PDM_ROUTE1_ADDR                 0x0000C185
#define BF_PDM1_ROUTE_INFO                  0x0000C185, 0x00000700

#define REG_KEY_SELECT_ADDR                 0x0000C190
#define BF_AUTH_DONE_INFO                   0x0000C190, 0x00000104
#define BF_DECRYPT_READY_INFO               0x0000C190, 0x00000105

