telink-semi/telink_rf4ce_sdk/tl_rf4ce_sdk/platform/tlsr_b92/reg_include/codec_0581_reg.h
#define REG_NONCE_1_ADDR                    0x0000C192

#define REG_AUTH_CHALLENGE_2_ADDR           0x0000C194

#define REG_AUTH_CHALLENGE_1_ADDR           0x0000C195

#define REG_AUTH_RESPONSE_2_ADDR            0x0000C197

#define REG_AUTH_RESPONSE_1_ADDR            0x0000C198

#define REG_READBACK_KEY_15_ADDR            0x0000C19A

#define REG_READBACK_KEY_14_ADDR            0x0000C19B

#define REG_READBACK_KEY_13_ADDR            0x0000C19C

#define REG_READBACK_KEY_12_ADDR            0x0000C19D

#define REG_READBACK_KEY_11_ADDR            0x0000C19E

#define REG_READBACK_KEY_10_ADDR            0x0000C19F

#define REG_READBACK_KEY_9_ADDR             0x0000C1A0

#define REG_READBACK_KEY_8_ADDR             0x0000C1A1

#define REG_READBACK_KEY_7_ADDR             0x0000C1A2

#define REG_READBACK_KEY_6_ADDR             0x0000C1A3

#define REG_READBACK_KEY_5_ADDR             0x0000C1A4

#define REG_READBACK_KEY_4_ADDR             0x0000C1A5

#define REG_READBACK_KEY_3_ADDR             0x0000C1A6

#define REG_READBACK_KEY_2_ADDR             0x0000C1A7

#define REG_READBACK_KEY_1_ADDR             0x0000C1A8

#define REG_DAC_NOISE_CTRL2_ADDR            0x0000CC04
#define BF_DAC_LOW_NOISE_EN2_INFO           0x0000CC04, 0x00000101

#define REG_DAC_NOISE_CTRL1_ADDR            0x0000CC13
#define BF_DAC_LOW_NOISE_EN1_INFO           0x0000CC13, 0x00000104

#define REG_XTAL_TEST_ADDR                  0x0000CC18

#define REG_EXTRA3_ADDR                     0x0000CC36

#define REG_PMU_CTRL2_ADDR                  0x0000CC3F

#if defined(__cplusplus)
}
#endif

#endif /* _CODEC_0581_REG_H_ */

/************************** end of file *****************************/
